___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [8]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [9]:
df['W']

A    0.681209
B   -1.005187
C   -1.382920
D    0.992573
E   -1.467514
Name: W, dtype: float64

In [10]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.681209  1.939932
B -1.005187 -0.732845
C -1.382920 -2.141212
D  0.992573  1.292765
E -1.467514  0.485809

In [11]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.681209
B   -1.005187
C   -1.382920
D    0.992573
E   -1.467514
Name: W, dtype: float64

DataFrame Columns are just Series

In [12]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [13]:
df['new'] = df['W'] + df['Y']

In [14]:
df

          W         X         Y         Z       new
A  0.681209  1.035125 -0.031160  1.939932  0.650049
B -1.005187 -0.741790  0.187125 -0.732845 -0.818062
C -1.382920  1.482495  0.961458 -2.141212 -0.421462
D  0.992573  1.192241 -1.046780  1.292765 -0.054206
E -1.467514 -0.494095 -0.162535  0.485809 -1.630049

**Removing Columns**

In [15]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

In [16]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.681209  1.035125 -0.031160  1.939932  0.650049
B -1.005187 -0.741790  0.187125 -0.732845 -0.818062
C -1.382920  1.482495  0.961458 -2.141212 -0.421462
D  0.992573  1.192241 -1.046780  1.292765 -0.054206
E -1.467514 -0.494095 -0.162535  0.485809 -1.630049

In [17]:
df.drop('new',axis=1,inplace=True)

In [18]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

Can also drop rows this way:

In [19]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

**Selecting Rows**

In [21]:
# This takes a label of the index (rows are also series)
df.loc['A']

W    0.681209
X    1.035125
Y   -0.031160
Z    1.939932
Name: A, dtype: float64

Or select based off of position instead of label

In [23]:
# Using index based location
df.iloc[2]

W   -1.382920
X    1.482495
Y    0.961458
Z   -2.141212
Name: C, dtype: float64

**Selecting subset of rows and columns**

In [24]:
# Get row 'B' column 'Y'
df.loc['B','Y']

0.1871245217641948

In [25]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.681209 -0.031160
B -1.005187  0.187125

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [26]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

In [27]:
df>0

       W      X      Y      Z
A   True   True  False   True
B  False  False   True  False
C  False   True   True  False
D   True   True  False   True
E  False  False  False   True

In [28]:
df[df>0]

          W         X         Y         Z
A  0.681209  1.035125       NaN  1.939932
B       NaN       NaN  0.187125       NaN
C       NaN  1.482495  0.961458       NaN
D  0.992573  1.192241       NaN  1.292765
E       NaN       NaN       NaN  0.485809

In [30]:
# When using this type of conditional selection (a column that meets a condition) we only get the rows that meet that condition, with no NaN values:
df[df['W']>0]

          W         X        Y         Z
A  0.681209  1.035125 -0.03116  1.939932
D  0.992573  1.192241 -1.04678  1.292765

In [31]:
df[df['W']>0]['Y']

A   -0.03116
D   -1.04678
Name: Y, dtype: float64

In [32]:
df[df['W']>0][['Y','X']]

         Y         X
A -0.03116  1.035125
D -1.04678  1.192241

For two conditions you can use | and & with parenthesis:

In [35]:
df[(df['W']>0) & (df['Y'] < 1)]

          W         X        Y         Z
A  0.681209  1.035125 -0.03116  1.939932
D  0.992573  1.192241 -1.04678  1.292765

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [36]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

In [37]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.681209  1.035125 -0.031160  1.939932
1     B -1.005187 -0.741790  0.187125 -0.732845
2     C -1.382920  1.482495  0.961458 -2.141212
3     D  0.992573  1.192241 -1.046780  1.292765
4     E -1.467514 -0.494095 -0.162535  0.485809

In [38]:
newind = 'CA NY WY OR CO'.split()

In [39]:
df['States'] = newind

In [40]:
df

          W         X         Y         Z States
A  0.681209  1.035125 -0.031160  1.939932     CA
B -1.005187 -0.741790  0.187125 -0.732845     NY
C -1.382920  1.482495  0.961458 -2.141212     WY
D  0.992573  1.192241 -1.046780  1.292765     OR
E -1.467514 -0.494095 -0.162535  0.485809     CO

In [41]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.681209  1.035125 -0.031160  1.939932
NY     -1.005187 -0.741790  0.187125 -0.732845
WY     -1.382920  1.482495  0.961458 -2.141212
OR      0.992573  1.192241 -1.046780  1.292765
CO     -1.467514 -0.494095 -0.162535  0.485809

In [42]:
df

          W         X         Y         Z States
A  0.681209  1.035125 -0.031160  1.939932     CA
B -1.005187 -0.741790  0.187125 -0.732845     NY
C -1.382920  1.482495  0.961458 -2.141212     WY
D  0.992573  1.192241 -1.046780  1.292765     OR
E -1.467514 -0.494095 -0.162535  0.485809     CO

In [43]:
df.set_index('States',inplace=True)

In [44]:
df

               W         X         Y         Z
States
CA      0.681209  1.035125 -0.031160  1.939932
NY     -1.005187 -0.741790  0.187125 -0.732845
WY     -1.382920  1.482495  0.961458 -2.141212
OR      0.992573  1.192241 -1.046780  1.292765
CO     -1.467514 -0.494095 -0.162535  0.485809

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [3]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [4]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [5]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [6]:
df.loc['G1']

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [7]:
df.loc['G1'].loc[1]

A    2.706850
B    0.628133
Name: 1, dtype: float64

In [8]:
df.index.names

FrozenList([None, None])

In [9]:
df.index.names = ['Group','Num']

In [10]:
df

                  A         B
Group Num
G1    1    2.706850  0.628133
      2    0.907969  0.503826
      3    0.651118 -0.319318
G2    1   -0.848077  0.605965
      2   -2.018168  0.740122
      3    0.528813 -0.589001

In [11]:
df.loc['G1'].loc[3]['A']

0.6511179479432686

In [12]:
# Returns a cross section of rows or columns when having a multi-level index
df.xs('G1')

            A         B
Num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [13]:
df.xs(['G1',1])

/tmp/ipykernel_1744/580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    2.706850
B    0.628133
Name: (G1, 1), dtype: float64

In [14]:
df.xs(1,level='Num')

              A         B
Group
G1     2.706850  0.628133
G2    -0.848077  0.605965

# Great Job!